# Dados Customer

In [2]:
import sqlite3
import pandas as pd

In [3]:
df = pd.read_csv("Dados/customer_dim.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [46]:
con = sqlite3.connect("projetoecommerce.db")  # Cria um banco de dados SQLite

In [47]:
cursor = con.cursor()

In [5]:
df.to_sql("customer_dim", con, if_exists="replace", index=False)

9191

In [6]:
query = "SELECT * FROM customer_dim LIMIT 5"
resultado = pd.read_sql_query(query, con)
print(resultado)

  coustomer_key             name     contact_no            nid
0       C000001            sumit  8801920345851  7505075708899
1       C000002         tammanne  8801817069329  1977731324842
2       C000003    kailash kumar  8801663795774  3769494056318
3       C000004  bhagwati prasad  8801533627961  9378834712725
4       C000005             ajay  8801943715786  3540815556323

In [7]:
query1 = "SELECT coustomer_key, typeof(coustomer_key), name, typeof(name), contact_no, typeof(contact_no), nid, typeof(nid) FROM customer_dim LIMIT 1"
resultado1 = pd.read_sql_query(query1, con)
print(resultado1)

  coustomer_key typeof(coustomer_key)   name typeof(name)     contact_no  \
0       C000001                  text  sumit         text  8801920345851

  typeof(contact_no)            nid typeof(nid)
0            integer  7505075708899     integer

In [8]:
con.execute("CREATE TABLE customer_dim_alt (customer_key TEXT, name TEXT, contact_no TEXT, nid TEXT);")
con.commit()

In [9]:
pd.read_sql_query("PRAGMA table_info(customer_dim_alt);", con)

   cid          name  type  notnull dflt_value  pk
0    0  customer_key  TEXT        0       None   0
1    1          name  TEXT        0       None   0
2    2    contact_no  TEXT        0       None   0
3    3           nid  TEXT        0       None   0

In [10]:
query2 = """INSERT INTO customer_dim_alt (customer_key, name, contact_no, nid)
SELECT coustomer_key, name, contact_no, nid FROM customer_dim;"""
con.execute(query2)  # Executa o comando
con.commit()  # Salva as alterações no banco

In [11]:
query3 = "SELECT * FROM customer_dim_alt LIMIT 5"
resultado3 = pd.read_sql_query(query3, con)
print(resultado3)

  customer_key             name     contact_no            nid
0      C000001            sumit  8801920345851  7505075708899
1      C000002         tammanne  8801817069329  1977731324842
2      C000003    kailash kumar  8801663795774  3769494056318
3      C000004  bhagwati prasad  8801533627961  9378834712725
4      C000005             ajay  8801943715786  3540815556323

In [12]:
queryy = "DROP TABLE backup_tabela;"
con.execute(queryy)  # Executa o comando
con.commit()  # Salva as alterações no banco

In [13]:
query4 = "ALTER TABLE customer_dim RENAME TO backup_tabela;"
con.execute(query4)  # Executa o comando
con.commit()  # Salva as alterações no banco

In [14]:
query5 = "ALTER TABLE customer_dim_alt RENAME TO customer_dim;"
con.execute(query5)  # Executa o comando
con.commit()  # Salva as alterações no banco

In [15]:
# Escrever uma consulta SQL
query6 = "SELECT * FROM customer_dim"

# Ler os dados diretamente no DataFrame
df = pd.read_sql_query(query6, con)

# Dados Transaction

In [16]:
df1 = pd.read_csv("Dados/trans_dim.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [17]:
df1.to_sql("Trans_dim", con, if_exists="replace", index=False)

39

In [18]:
query7 = "SELECT * FROM Trans_dim LIMIT 5"
resultado7 = pd.read_sql_query(query7, con)
print(resultado7)

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

In [19]:
pd.read_sql_query("PRAGMA table_info(Trans_dim);", con)

   cid         name  type  notnull dflt_value  pk
0    0  payment_key  TEXT        0       None   0
1    1   trans_type  TEXT        0       None   0
2    2    bank_name  TEXT        0       None   0

In [20]:
# Escrever uma consulta SQL
query8 = "SELECT * FROM Trans_dim"

# Ler os dados diretamente no DataFrame
df1 = pd.read_sql_query(query8, con)

# Dados Fato

In [21]:
df2 = pd.read_csv("Dados/fact_table.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [22]:
df2.to_sql("fact_table", con, if_exists="replace", index=False)

1000000

In [23]:
query9 = "SELECT * FROM fact_table LIMIT 5"
resultado9 = pd.read_sql_query(query9, con)
print(resultado9)

  payment_key coustomer_key time_key item_key store_key  quantity   unit  \
0        P026       C004510  T049189   I00177    S00307         1     ct
1        P022       C008967  T041209   I00248    S00595         1  rolls
2        P030       C007261   T03633   I00195    S00496         8     ct
3        P032       C007048  T084631   I00131     S0086         8     ct
4        P014       C006430  T071276   I00050    S00488         8   cans

   unit_price  total_price
0        35.0         35.0
1        26.0         26.0
2        12.5        100.0
3        14.0        112.0
4         8.0         64.0

In [24]:
pd.read_sql_query("PRAGMA table_info(fact_table);", con)

   cid           name     type  notnull dflt_value  pk
0    0    payment_key     TEXT        0       None   0
1    1  coustomer_key     TEXT        0       None   0
2    2       time_key     TEXT        0       None   0
3    3       item_key     TEXT        0       None   0
4    4      store_key     TEXT        0       None   0
5    5       quantity  INTEGER        0       None   0
6    6           unit     TEXT        0       None   0
7    7     unit_price     REAL        0       None   0
8    8    total_price     REAL        0       None   0

In [25]:
# Escrever uma consulta SQL
query10 = "SELECT * FROM fact_table"

# Ler os dados diretamente no DataFrame
df2 = pd.read_sql_query(query10, con)

# Dados Store

In [26]:
df3 = pd.read_csv("Dados/store_dim.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [27]:
df3.to_sql("store_dim", con, if_exists="replace", index=False)

726

In [28]:
query11 = "SELECT * FROM store_dim LIMIT 5"
resultado11 = pd.read_sql_query(query11, con)
print(resultado11)

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

In [29]:
pd.read_sql_query("PRAGMA table_info(store_dim);", con)

   cid       name  type  notnull dflt_value  pk
0    0  store_key  TEXT        0       None   0
1    1   division  TEXT        0       None   0
2    2   district  TEXT        0       None   0
3    3    upazila  TEXT        0       None   0

In [30]:
# Escrever uma consulta SQL
query12 = "SELECT * FROM store_dim"

# Ler os dados diretamente no DataFrame
df3 = pd.read_sql_query(query12, con)

In [31]:
# Dicionário com as populações das cidades
population_dict = {
    'DHAKA': 10200000,
    'CHITTAGONG': 5500000,
    'RAJSHAHI': 553300,
    'KHULNA': 965500,
    'RANGPUR': 343100,
    'BARISAL': 202200,
    'SYLHET': 237000
}

# Adicionando a nova coluna 'population' ao dataframe
df3['population'] = df3['division'].map(population_dict)

df3.head()

  store_key division  district         upazila  population
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ      237000
1     S0002   SYLHET  HABIGANJ         BAHUBAL      237000
2     S0003   SYLHET  HABIGANJ      BANIACHONG      237000
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT      237000
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR      237000

In [33]:
df3.to_csv('Dados/store_dim_com_population.csv', index=False)

In [44]:
df3 = pd.read_csv("Dados/store_dim_com_population.csv", encoding="ISO-8859-1")

In [48]:
df3.to_sql("store_dim_com_population", con, if_exists="replace", index=False)

726

# Dados Time

In [34]:
df4 = pd.read_csv("Dados/time_dim.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [35]:
df4.to_sql("time_dim", con, if_exists="replace", index=False)

99999

In [36]:
query13 = "SELECT * FROM time_dim LIMIT 5"
resultado13 = pd.read_sql_query(query13, con)
print(resultado13)

  time_key              date  hour  day      week  month quarter  year
0   T00001  20-05-2017 14:56    14   20  3rd Week      5      Q2  2017
1   T00002  30-01-2015 22:14    22   30  4th Week      1      Q1  2015
2   T00003  14-03-2020 02:34     2   14  2nd Week      3      Q1  2020
3   T00004  27-04-2018 12:19    12   27  4th Week      4      Q2  2018
4   T00005  14-04-2018 10:43    10   14  2nd Week      4      Q2  2018

In [37]:
pd.read_sql_query("PRAGMA table_info(time_dim);", con)

   cid      name     type  notnull dflt_value  pk
0    0  time_key     TEXT        0       None   0
1    1      date     TEXT        0       None   0
2    2      hour  INTEGER        0       None   0
3    3       day  INTEGER        0       None   0
4    4      week     TEXT        0       None   0
5    5     month  INTEGER        0       None   0
6    6   quarter     TEXT        0       None   0
7    7      year  INTEGER        0       None   0

In [38]:
# Escrever uma consulta SQL
query14 = "SELECT * FROM time_dim"

# Ler os dados diretamente no DataFrame
df4 = pd.read_sql_query(query14, con)

# Dados Item

In [39]:
df5 = pd.read_csv("Dados/item_dim.csv", encoding="ISO-8859-1")  # Substitua pelo nome do seu arquivo

In [40]:
df5.to_sql("item_dim", con, if_exists="replace", index=False)

264

In [41]:
query15 = "SELECT * FROM item_dim LIMIT 5"
resultado15 = pd.read_sql_query(query15, con)
print(resultado15)

  item_key                        item_name                desc  unit_price  \
0   I00001       A&W Root Beer - 12 oz cans  a. Beverage - Soda       11.50
1   I00002  A&W Root Beer Diet - 12 oz cans  a. Beverage - Soda        6.75
2   I00003    Barq's Root Beer - 12 oz cans  a. Beverage - Soda        6.75
3   I00004                 Cherry Coke 12oz  a. Beverage - Soda        6.75
4   I00005         Cherry Coke Zero 12 pack  a. Beverage - Soda        6.75

   man_country            supplier  unit
0  Netherlands     Bolsius Boxmeer  cans
1       poland  CHROMADURLIN S.A.S  cans
2   Bangladesh        DENIMACH LTD  cans
3  Netherlands     Bolsius Boxmeer  cans
4      Finland         HARDFORD AB  cans

In [42]:
pd.read_sql_query("PRAGMA table_info(item_dim);", con)

   cid         name  type  notnull dflt_value  pk
0    0     item_key  TEXT        0       None   0
1    1    item_name  TEXT        0       None   0
2    2         desc  TEXT        0       None   0
3    3   unit_price  REAL        0       None   0
4    4  man_country  TEXT        0       None   0
5    5     supplier  TEXT        0       None   0
6    6         unit  TEXT        0       None   0

In [43]:
# Escrever uma consulta SQL
query16 = "SELECT * FROM item_dim"

# Ler os dados diretamente no DataFrame
df5 = pd.read_sql_query(query16, con)

# Fechar a conexão
con.close()